Repository: mazenanter/MediCare
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Change Language
ar: غيّر اللغة

source: Cancel
ar: إلغاء

# SureToChangeLanguage
source: Are you sure you want to change the language?
ar: متأكد إنك عايز تغيّر اللغة؟

source: Ok
ar: تمام

source: Welcome to
ar: أهلاً بيك في

source: MediCare
ar: دوائي

# YourPersonalAssistantForMmanagingYourMmedicationSchedule
source: Your personal assistant for managing your medication schedule.
ar: مساعدك الشخصي لتنظيم مواعيد أدويتك.

source: Login
ar: تسجيل الدخول

source: Register
ar: تسجيل جديد

source: Welcome back! Glad to see you, Again!
ar: أهلاً بيك! مبسوطين إننا نشوفك تاني!

source: Forgot Password?
ar: نسيت كلمة السر؟

source: At least 1 lowercase letter
ar: على الأقل حرف صغير واحد

source: At least 1 uppercase letter
ar: على الأقل حرف كبير واحد

source: At least 1 number
ar: على الأقل رقم واحد

source: At least 1 special character
ar: على الأقل رمز خاص واحد

source: At least 8 characters
ar: على الأقل 8 حروف

source: Continue with Google
ar: كمل باستخدام جوجل

source: Enter your email
ar: اكتب الإيميل بتاعك

source: Enter your password
ar: اكتب كلمة السر بتاعتك

source: Don't have an account yet?
ar: لسه معندكش حساب؟

source: Or
ar: أو

source: Hello! Register to get started
ar: أهلاً! سجل حسابك عشان تبدأ

source: Enter Your Username
ar: اكتب اسم المستخدم بتاعك

source: Confirm Password
ar: أكد كلمة السر

source: Already have an account?
ar: عندك حساب بالفعل؟

# SomethingWentWrongPleaseTtryAgain
source: Something went wrong, please try again.
ar: في حاجة غلط، حاول تاني.

source: Email already in use, please use a different email.
ar: الإيميل ده مستخدم قبل كده، جرب إيميل تاني.

source: Password too weak!
ar: كلمة السر ضعيفة جدًا!

source: Invalid email address, please check and try again.
ar: الإيميل مش صحيح، راجعه وحاول تاني.

# UserNotFound
source: User not found for that email address.
ar: مفيش مستخدم مسجل بالإيميل ده.

# WrongPassword
source: Wrong password for that user.
ar: كلمة السر غلط للمستخدم ده.

# ThereIsNoInternetConnection
source: There is no internet connection, please try again.
ar: مفيش اتصال بالإنترنت، حاول تاني.

# AttemptsHaveBeenTemporarilyBlocked
source: Attempts have been temporarily blocked due to too many requests. Please try again later.
ar: المحاولات اتقفلت مؤقتًا عشان في محاولات كتير، حاول بعد شوية.

# LoginWithThisAaccountIsNotEnabled
source: Login with this account is not enabled.
ar: تسجيل الدخول بالحساب ده مش متاح.

# AnArrorOccurred
source: An error occurred during login. Please try again.
ar: حصل خطأ أثناء تسجيل الدخول، حاول تاني.

# permissionDenied
source: You do not have permission to access this resource.
ar: ملوش صلاحية للوصول للمصدر ده.

# firebaseUnavailable
source: Firebase service is currently unavailable. Please try again later.
ar: خدمة Firebase مش متاحة دلوقتي، حاول بعد شوية.

# operationCancelled
source: The operation has been canceled.
ar: العملية اتلغت.

# itemNotFound
source: The requested item is not found.
ar: العنصر المطلوب مش موجود.

# itemAlreadyExists
source: This item already exists.
ar: العنصر ده موجود بالفعل.

# resourceExhausted
source: You have exceeded the allowed limit. Please try again later.
ar: تعديت الحد المسموح بيه، حاول تاني بعد شوية.

# firebaseErrors
source: An error occurred while handling Firebase.
ar: حصل خطأ أثناء التعامل مع Firebase.

source: Email created successfully
ar: تم إنشاء الإيميل بنجاح.

source: Success
ar: تم بنجاح

source: Error
ar: خطأ

source: Please enter your name
ar: من فضلك ادخل اسمك

source: Please enter valid email
ar: من فضلك ادخل إيميل صحيح

source: Please enter valid passowrd
ar: من فضلك ادخل كلمة سر صحيحة

source: Missing access token or ID token
ar: لا يوجد توكن او توكن ID

source: Login Success
ar: تم تسجيل الدخول بنجاح

# InvalidCredential
source: Email or password is incorrect.
ar: الايميل او الباسورد غلط, جرب تاني

source: Manage your meds
ar: إدارة أدويتك

# AddYourMedsToBeReminded
source: Add your meds to be reminded on time and track your health
ar: ضيف أدويتك عشان تفتكرها في معادها وتتابع صحتك

source: Add medicine
ar: إضافة دواء

source: Today
ar: انهاردة

source: Intakes
ar: الجرعات

source: Tablet
ar: أقراص

source: Capsule
ar: كبسولات

source: Injection
ar: حقنة

source: Drop
ar: نقط

source: Name*
ar: الاسم*

source: Type*
ar: النوع*

source: Dose*
ar: الجرعة*

source: Time*
ar: الوقت*

source: Add
ar: إضافة

source: Amount*
ar: الكمية*

source: First Date*
ar: اول تاريخ*

source: Reminders
ar: التذكيرات

# NameEG
source: Name (e.g. Ibuprofen)
ar: الاسم (مثلاً: إيبوبروفين)

# TypeEG
source: Type (e.g. Tablet)
ar: النوع (مثلاً: أقراص)

# DoseEG
source: Dose (e.g. 400mg)
ar: الجرعة (مثلاً: 400 مجم)

# AmountEG
source: Amount (e.g. 2)
ar: الكمية (مثلاً: 2)

source: Add New Medicine
ar: إضافة دواء جديد

source: Add Reminder
ar: إضافة تذكير

# FillOutTheFields
source: Fill out the fields and hit the Save Button to add it!
ar: املأ البيانات واضغط زر الحفظ عشان تضيفه!

source: Save
ar: حفظ

source: User not logged in
ar: المستخدم مش مسجل دخوله

source: Did you take your Medicine?
ar: هل أخدت دواءك؟

source: Scheduled for
ar: مجدول لـ

source: Take
ar: خد الدواء

source: Edit
ar: تعديل

source: One time
ar: مرة واحدة

source: Daily
ar: كل يوم

source: Every X hours
ar: كل عدد معين من الساعات

source: Repeat every*
ar: كرر كل*

source: Select repeat time
ar: اختار وقت التكرار

source: Hours*
ar: ساعات*

source: (e.g. 2 hours)
ar: (مثال: كل 2 ساعة)

source: Days*
ar: أيام*

source: (e.g. 2 Days)
ar: (مثال: كل 2 يوم)

source: Deleted successfully
ar: تم الحذف بنجاح

source: Delete Medication
ar: حذف الدواء

source: Are you sure you want to delete this medication?
ar: هل أنت متأكد أنك عايز تحذف الدواء ده؟

source: Delete
ar: حذف

source: Hours for
ar: ساعات لـ
